{
  "ARM_CFG_GROUPS": {
    "BEGIN": "# ARM (Automatic Ripping Machine) config file\n\n#################\n## ARM Options ##\n#################",
    "DIR_SETUP": "#####################\n## Directory setup ##\n#####################",
    "WEB_SERVER": "##################\n##  Web Server  ##\n##################",
    "FILE_PERMS": "\n########################\n##  File Permissions  ##\n########################",
    "MAKE_MKV": "########################\n## MakeMKV Parameters ##\n########################",
    "HANDBRAKE": "##########################\n## HandBrake Parameters ##\n##########################",
    "EMBY": "#####################\n## Emby Parameters ##\n#####################",
    "EMBY_ADDITIONAL": "# Parameters to enable automatic library scan in Emby.  This will trigger only if MainFeature is true above.",
    "NOTIFY_PERMS": "#############################\n## Notification Parameters ##\n#############################",
    "APPRISE": "#################################################\n##            APPRISE NOTIFICATIONS            ##\n#################################################"
  },
  "ARM_NAME": "# A friendly name for this machine. Useful if you are running multiple instances.\n# Used in notification titles.",
  "ARM_CHILDREN": "# Comma delimited list of child ARM servers to display on the Home Page\n# Should be full protocol, path, and port: http://192.168.0.100:8080/",
  "PREVENT_99": "# Workaround for Track 99\n# A DRM scheme used on some DVDs which creates fake titles which confuses Handbrake.\n# When set to \"false\" affected DVDs will be passed to MakeMKV for ripping, but this can crash or hang\n# Setting this to true will eject the disc and log only to the system logging",
  "ARM_CHECK_UDF": "# Distinguish UDF video discs from UDF data discs.  Requires mounting disc so adds a few seconds to the identify script.",
  "GET_VIDEO_TITLE": "# When enabled if the disc is a DVD use dvdid to calculate a crc64 and query Windows Media Meta Services for the Movie Title.\n# For BluRays attempts to extract the title from an XML file on the disc",
  "ARM_API_KEY": "# ARM dvd crc64 api key\n# This is only needed if you would like to send movies to the database",
  "DISABLE_LOGIN": "# Do you want to be forced to login to view/edit jobs\n# True will leave all of the pages open to be editable/viewable by anyone\n# False will require you to login to view/edit jobs or settings from the ui\n# ARMui will need to be restared for this to update",
  "SKIP_TRANSCODE": "# Skip transcoding if you want the original MakeMKV files as your final output\n# This will produce the highest quality videos (and use the most storage)\n# Note: RIPMETHOD must be set to \"mkv\" for this feature to work\n# Note: The largest file will be considered to be the \"main feature\" but there are cases when this is not true\n# to avoid losing a desired track, use this feature with an EXTRAS_SUB value that is not \"None\"",
  "VIDEOTYPE": "# Video type identification.  Options are \"auto\", \"series\", \"movie\".\n# If \"auto\" then ARM will get the video type when querying the movie webservice.  This is default.\n# If the disc is not clearly a movie or series, or if ARM is having difficulty getting the right video type\n# you can override the automatic identification with \"series\" or \"movie\"",
  "MINLENGTH": "# Minimum length of track for ARM rip (in seconds)",
  "MAXLENGTH": "# Maximum length of track for ARM rip (in seconds)\n# Use \"99999\" to indicate no maximum length",
  "MANUAL_WAIT": "# Wait for manual identification",
  "MANUAL_WAIT_TIME": "# Wait time for manual identification (in seconds)",
  "DATE_FORMAT": "# Allows you to format the date/time to your own liking\n# This will be used throughout ARM and ARMui",
  "ALLOW_DUPLICATES": "## Do you want to allow Rips of the same disk multiple times\n## With this set as false the task will exit if it recognises the same movie being ripped\n## recommended to set to true for series ",
  "MAX_CONCURRENT_TRANSCODES": "# Number of Transcodes that runs at the same time.\n# Certain Video cards are limited to how many encodes they can run at the same time.\n# Also useful for diminishing returns on CPU based encodes.\n# Set to 0 to disable",
  "MAX_CONCURRENT_MAKEMKVINFO": "# Number of MakeMKV info calls that are allowed to run.\n#This can be set to 1 if makemkvcon info calls lead to crashes on backup or mkv calls.\n# Set to 0 to disable",
  "DATA_RIP_PARAMETERS": "# Additional parameters for dd. e.g. \"conv=noerror,sync\" for ignoring read errors",
  "METADATA_PROVIDER": "# This selects the metadata provider, Each provider has their own ups and downs\n# But a general rule would be \n# OMDB for movies and shows \n# TMDB for movies only\n# You will still need to provide an api key for the provider you have selected",
  "GET_AUDIO_TITLE": "# Set to one of \"none\", \"musicbrainz\", \"freecddb\"\n# if \"musicbrainz\" is used the disc information are asked from musicbrainz.org\n# if \"none\" is used no label is identified",
  "RIP_POSTER": "# Rip DVD Posters from JACKET_P folder\n# Requires FFmpeg",
  "UNIDENTIFIED_EJECT": "# Auto-eject unidentified discs (blank etc)\n# May want to set this to false on certain (Pioneer slim) drives to prevent the immediate eject\n# issue (https://github.com/automatic-ripping-machine/automatic-ripping-machine/issues/779)",
  "AUTO_EJECT": "# Auto-ejects disks\n# Auto-ejects disks when complete etc\n# Set to false to disable auto-ejection",
  "ABCDE_CONFIG_FILE": "# Location of your ABCDE config file",
  "RAW_PATH": "# Path to raw MakeMKV directory\n# Destination for MakeMKV and source for HandBrake",
  "TRANSCODE_PATH": "# Intermediary directory for transcoding files\n# Destination for HandBrake",
  "COMPLETED_PATH": "# Final directory of transcoded files\n# Ripped and transcoded files end up here",
  "EXTRAS_SUB": "# Movie subdirectory name for \"extras\"\n# Valid names are dependent on your media server\n# For Emby see https://github.com/MediaBrowser/Wiki/wiki/Movie%20naming#user-content-movie-extras\n# For Plex see https://support.plex.tv/hc/en-us/articles/200220677",
  "INSTALLPATH": "# Path to installation of ARM ",
  "LOGPATH": "# Path to directory to hold log files\n# Make sure to include trailing /",
  "LOGLEVEL": "# Log level.  DEBUG, INFO, WARNING, ERROR, CRITICAL\n# The default is INFO\n# If you are experiencing difficulties set this to DEBUG",
  "LOGLIFE": "# How long to let log files live before deleting (in days)\n# Set to 0 to disable",
  "DBFILE": "# Path to ARM database file",
  "WEBSERVER_IP": "# IP address of web server (this machine)\n# Use x.x.x.x to autodetect the IP address to use",
  "WEBSERVER_PORT": "# Port for web server",
  "UI_BASE_URL": "# Base URL to use for notifications and display purposes\n#Be sure to include protocol and port if needed (e.g. http://example.com:8091 or https://example.com)",
  "SET_MEDIA_PERMISSIONS": "# Enabling this setting will allow you to adjust the default file permissions of the outputted files\n# The default value is set to 777 for read/write/execute for all users, but can be changed below using the \"CHMOD_VALUE\" setting\n# This setting is helpful when storing the data locally on the system",
  "CHMOD_VALUE": "",
  "SET_MEDIA_OWNER": "# Don't bother. This does not do anything yet",
  "CHOWN_USER": "",
  "CHOWN_GROUP": "",
  "MAKEMKV_PERMA_KEY": "# Storage for a purchased key the user may have paid for. Populating will prevent the beta key updater from running.",
  "RIPMETHOD": "# Method of MakeMKV to use for Blu Ray discs.  Options are \"mkv\", \"backup\" or \"backup_dvd\".\n# backup decrypts the dvd and then copies it to the hard drive.  This allows HandBrake to apply some of it's\n# analytical abilities such as the main-feature identification.  This method seems to offer success on bluray \n# discs that fail in \"mkv\" mode. *** NOTE: MakeMKV only supports the backup or backup_dvd method on BluRay discs.\n# backup_dvd forces arm to extract the dvd with MakeMKV prior to the Handbrake step",
  "MKV_ARGS": "# MakeMKV Arguments\n# MakeMKV Profile used for controlling Audio Track Selection.\n# This is the default profile MakeMKV uses for Audio track selection. Updating this file or changing it is considered\n# to be advanced usage of MakeMKV. But this will allow users to alternatively tell makemkv to select HD audio tracks and etc.\n# MKV_ARGS: \"--profile=/opt/arm/default.mmcp.xml\"\n# MKV_ARGS: \"--debug=-stdout\"  # this will enable more detailed logging",
  "DELRAWFILES": "# Remove the files created by MakeMKV after processing is complete",
  "HB_PRESET_DVD": "# Handbrake preset profile for DVDs\n# Execute \"HandBrakeCLI -z\" to see a list of all presets",
  "HB_PRESET_BD": "# Handbrake preset profile for Blurays\n# Execute \"HandBrakeCLI -z\" to see a list of all presets",
  "DEST_EXT": "# Extension of the final video file",
  "HANDBRAKE_CLI": "# Handbrake binary to call.  These should be the same unless you are doing remote processing.",
  "HANDBRAKE_LOCAL": "# Handbrake binary to call.  These should be the same unless you are doing remote processing.",
  "MAINFEATURE": "# Have HandBrake transcode the main feature only.  BluRay discs must have RIPMETHOD=\"backup\" for this to work.\n# If MAINFEATURE is true, blurays will be backed up to the HD and then HandBrake will go to work on the backed up\n# files.  \n# This will require libdvdcss2 be installed.\n# NOTE: For the most part, HandBrake correctly identifies the main feature on movie DVD's, although it is not perfect. \n# However, it does not handle tv shows well at all.  This setting is only used when the video is identified as a movie.",
  "HB_ARGS_DVD": "# Additional HandBrake arguments for DVDs.",
  "HB_ARGS_BD": "# Additional Handbrake arguments for Bluray Discs.",
  "EMBY_REFRESH": "# Scan emby library after successful placement of mainfeature (see above)",
  "EMBY_SERVER": "# Server parameters\n# Server can be ip address or domain name",
  "EMBY_PORT": "",
  "EMBY_CLIENT": "# Emby authentication fluff parameters.  These can be anything.\n",
  "EMBY_DEVICE": "",
  "EMBY_DEVICEID": "",
  "EMBY_USERNAME": "# Emby authentication parameters.  These are parameters that must be set to a current user in Emby.",
  "EMBY_USERID": "# EMBY_USERID is the user ID associated with the username above.  You can find this by going to the following address on your emby server\n# <server>:<port>/Users/Public and getting the ID value for the username above.",
  "EMBY_PASSWORD": "# This is the SHA1 encrypted password for the username above.  You can generate the SHA1 hash of your password by executing the following at\n# the command line: \n# echo -n your-password | sha1sum | awk '{print $1}'\n# or using an online generator like the one located at http://www.sha1-online.com/",
  "EMBY_API_KEY": "# Emby API key.  This can be found (generated) by going to Advanced/Security in the \n# Emby dashboard",
  "NOTIFY_RIP": "# Notify after Rip?",
  "NOTIFY_TRANSCODE": "# Notify after transcode?",
  "NOTIFY_JOBID": "# Add Job ID to Notification Title",
  "PB_KEY": "# Pushbullet API Key\n# Leave empty to disable Pushbullet notifications",
  "IFTTT_KEY": "# IFTTT API KEY\n# Leave empty to disable IFTTT notifications",
  "IFTTT_EVENT": "# IFTTT Event Name",
  "PO_USER_KEY": "# Pushover API User and Application Key\n# Leave User key empty to disable Pushover notifications",
  "PO_APP_KEY": "",
  "OMDB_API_KEY": "# OMDB_API_KEY\n# omdbapi.com API Key\n# See README-OMDBAPI for background and info\n# This is the API key for omdbapi.com queries.\n# More info at https://omdbapi.com/",
  "TMDB_API_KEY": "# TMDB_API_KEY\n# https://www.themoviedb.org/ API Key\n# See README-OMDBAPI for background and info\n# This is the API key for https://www.themoviedb.org/ queries.\n# More info at https://www.themoviedb.org/documentation/api",
  "JSON_URL": "# JSON_URL\n# Url to send Notifications to in JSON format",
  "APPRISE": "# File location of your apprise.yaml file. \n# Docker default is '/etc/arm/config/apprise.yaml'.",
  "index_refresh": "How often to refresh the home page in milliseconds #\n (This updates jobs) #\n Default setting is '2000', updating the home page every 2 seconds.",
  "use_icons": "Use icons, if false A.R.M will use text \n##ripping|transcoding|etc",
  "save_remote_images": "Save job images locally ? \n# If True: A.R.M will copy remote images to a local directory and use the update the job to use the local version.",
  "bootstrap_skin": "Bootstrap remote skin \n# You can find all versions available from \n#https://www.bootstrapcdn.com/bootswatch/\n# You will need to refresh the page to see the updated bootstrap skin",
  "language": "What language do you want A.R.M to use ?",
  "database_limit": "limit the number of jobs to show on each page, over 175 will make things go funky!",
  "notify_refresh": "Set the Notification timeout value in milliseconds, values less than 1 second should be avoided."
}
